{
  "tesla_ai_self_driving_internship": "Explain to a Tesla recruiter who is assigned this role why Immanuel is a top candidate for this role. <jobposting> Internship, AI Engineer, Self-Driving (Winter/Spring 2026) Job Category AI & Robotics Location Palo Alto, California Req. ID 251497 Job Type Intern/Apprentice What to Expect Tesla is seeking exceptional Machine Learning Interns to help build large scale models to drive the future of autonomy across all current and future generations of Tesla AI products. You will work on a lean team without boundaries and have access to one of the world’s largest training clusters with a data engine that constantly generates new information for improving our models. Most importantly, you will see your work repeatedly shipped to and utilized by millions of Tesla’s customers. We are seeking Interns in the following AI disciplines: Train large-scale foundation and generative models that are optimized for performance and latency Improve data engine for large scale and high-quality dataset curation Reinforcement Learning for instilling objectives and improving overall robustness Design compound AI systems for better planning and reasoning What You’ll Do Applied research in the areas of Foundation Models, including but not limited to computer vision, large language models and generative modeling Work on cutting-edge techniques in AI - multi-task learning, video networks, multi-modal generative models, imitation learning, reinforcement learning, semi-supervised learning, self-supervised learning Explore and implement novel AI tooling and techniques for efficient training and fine-tuning of large-scale models Leverage millions of miles of driving data and interventions to build a robust and scalable end-to-end learning based self-driving system Collaborate with a team to apply research findings to real-world challenges, ensuring high-quality system integration within existing platforms Experiment with data generation and network driven data collection approaches to enhance the diversity and quality of training data Ship production quality, safety-critical software to the entirety of Tesla’s vehicle fleet What You’ll Bring Demonstrated experience in machine learning frameworks and models such as PyTorch, TensorFlow, GPT, CNNs, and generative models Strong experience with Python and software engineering best practices Experience with one or more of imitation Learning, reinforcement learning (offline/off-policy), modern neural network architectures (e.g., GPT, diffusion, generative models), or related techniques An “under the hood” knowledge of deep learning: layer details, loss functions, optimization, etc. Prior experience with sparse training techniques, neural network pruning, and generative modeling Experience with training large models on distributed computing Ability to work on complex problems and produce significant research and/or experience deploying production ML models at scale Proven track record of innovations and executions in deep learning, demonstrated with shipping products or first-author publications at leading AI conferences </jobposting>"
}